БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыПодключаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыПодключаемыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты/Forms/ФормаВыбораВстроеннойОбработки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВнешнийОтчетовИОбработок();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВнешнихОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВнешнихОтчетов.ТекущиеДанные;
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВнешнихОбработокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВнешнихОбработок.ТекущиеДанные;
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьВыбор(СтрокаДерева)
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если РодительСтроки.Ссылка = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки") Тогда
		
		ТестПредупреждения = "Обработка уже подключена.";
		ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка");
		
	ИначеЕсли РодительСтроки.Ссылка = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты") Тогда
		
		ТестПредупреждения = "Отчет уже подключен.";
		ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет");
		
	Иначе
		
		//Неизвестный тип объекта
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Имя", 				СтрокаДерева.Имя);
	ДополнительныеПараметры.Вставить("Наименование", 		СтрокаДерева.Наименование);
	ДополнительныеПараметры.Вставить("ТипВнешнегоОбъекта", 	ТипВнешнегоОбъекта);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьВыборОбъкта", ЭтотОбъект,ДополнительныеПараметры);
	Если СтрокаДерева.Подключена Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТестПредупреждения +" Продолжить?" , Режим, 0);	
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборОбъкта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Ответ = Новый Структура;
	Ответ.Вставить("Имя", 					ДополнительныеПараметры.Имя);
	Ответ.Вставить("Представление", 		ДополнительныеПараметры.Наименование);
	Ответ.Вставить("ТипВнешнегоОбъекта", 	ДополнительныеПараметры.ТипВнешнегоОбъекта);
	
	ЭтаФорма.Закрыть(Ответ);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	РезультатВыполнения = НачатьФормирвоаниеСпискаДоступныхОтчетовИОбработок();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания	= Истина;
	ПараметрыОжидания.ТекстСообщения		= "Формируется список доступных отчетов и обработок...";
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьФормирвоаниеСпискаДоступныхОтчетовИОбработок()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование списка доступных отчтов и обработок";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ИдентификаторыПодключаемыхОбъектов.ОбновитьСписокПодключаемыхОтчетовОбработок",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЗаполнитьСписокВнешнийОтчетовИОбработок();                     
		
		ЭлементыДерева = ДеревоОбъектов.ПолучитьЭлементы();
		Для Каждого ЭлементДерева из ЭлементыДерева Цикл
			Элементы.ДеревоОбъектов.Развернуть(ЭлементДерева.получитьИдентификатор(), истина);
		КонецЦикла;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось получить список отчетов и обработок!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения списка отчетов и обработок");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВнешнийОтчетовИОбработок()
	
	тДерево = РеквизитФормыВЗначение("ДеревоОбъектов");
	тДерево.Строки.Очистить();
	
	мПодклчюенныеОбъекты = ПолучитьМассивПодключенныхОбъектов();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Родитель КАК Родитель,
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Имя КАК Имя,
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Наименование КАК Наименование,
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ИдентификаторыПодключаемыхОбъектов КАК CW_ИдентификаторыПодключаемыхОбъектов
	               |ГДЕ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ИдентификаторыПодключаемыхОбъектов.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Родитель УБЫВ,
	               |	Имя
	               |ИТОГИ ПО
	               |	Родитель
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппы.Следующий() Цикл
		
		Если ВыборкаГруппы.Родитель = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты") Тогда
			ИндексКартинки = 1;
		ИначеЕсли ВыборкаГруппы.Родитель = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки") Тогда
			ИндексКартинки = 2;
		КонецЕсли;
		
		СтрокаГруппа = тДерево.Строки.Добавить();
		СтрокаГруппа.Наименование  	= Строка(ВыборкаГруппы.Родитель);
		СтрокаГруппа.Ссылка 		= ВыборкаГруппы.Родитель;
		СтрокаГруппа.ЭтоГруппа 		= Истина;
		
		ВыборкаДетали = ВыборкаГруппы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			Подключена = мПодклчюенныеОбъекты.Найти(ВыборкаДетали.Имя) <> Неопределено;
			
			//Не подключенные(0), Подключенные(1), Все(2)    	     
			Если (ВариантОтбора = 0 и Подключена) 
				ИЛИ (ВариантОтбора = 1  и Не Подключена) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева = СтрокаГруппа.Строки.Добавить();
			СтрокаДерева.Наименование  	= ВыборкаДетали.Наименование;
			СтрокаДерева.Имя  			= ВыборкаДетали.Имя;
			СтрокаДерева.ЭтоГруппа 		= Ложь;
			СтрокаДерева.Подключена 	= Подключена;
			СтрокаДерева.Ссылка 		= ВыборкаДетали.Ссылка;
			СтрокаДерева.ИндексКартинки = ИндексКартинки;
			
		КонецЦикла;
		
	КонецЦикла;

	ЗначениеВРеквизитФормы(тДерево, "ДеревоОбъектов");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивПодключенныхОбъектов()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ПодключаемыеОбъекты.ИмяВстроеннойОбработки КАК ИмяВстроеннойОбработки
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.Встроенная = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ИмяВстроеннойОбработки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	
	ТекущаяСсылка =ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.ПустаяСсылка");
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущаяСсылка = ТекущиеДанные.Ссылка;
	КонецЕсли;
	ЗаполнитьСписокВнешнийОтчетовИОбработок();
	
	Если НЕ ТекущаяСсылка.Пустая() Тогда
		ИдентифкаторСтроки = ПолучитьИдентифкаторТекущейСтроки(ТекущаяСсылка);
		Если ИдентифкаторСтроки <> Неопределено Тогда
			Элементы.ДеревоОбъектов.ТекущаяСтрока = ИдентифкаторСтроки;
		КонецЕсли;
	КонецЕсли;
	
	СтрокиГруппы = ДеревоОбъектов.ПолучитьЭлементы();
	Для Каждого СтрокаГруппа из СтрокиГруппы Цикл
		Идентификатор = СтрокаГруппа.ПолучитьИдентификатор();
		Элементы.ДеревоОбъектов.Развернуть(Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентифкаторТекущейСтроки(ТекущаяСсылка)
	
	СтрокиДерева = ДеревоОбъектов.ПолучитьЭлементы();
	Для Каждого ГруппаТекущая из СтрокиДерева Цикл
		
		Если ГруппаТекущая.Ссылка = ТекущаяСсылка Тогда
			Возврат ГруппаТекущая.ПолучитьИдентификатор();
		КонецЕсли;
		
		СтрокиГруппы = ГруппаТекущая.ПолучитьЭлементы();
		Для Каждого СтрокаТекущая из СтрокиГруппы Цикл
			Если СтрокаТекущая.Ссылка = ТекущаяСсылка Тогда
				Возврат СтрокаТекущая.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
